Repository: liminany/PartsUnlimitedDocs-Translation
Catalog: OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: ### I: Import Source Code into your VSTS Account with Git
zh_cn: ## I. 第一部分: 使用Git从TFS/VSTS中导入代码

source: ### II.
zh_cn: # II. 第二部分

source: ### III.
zh_cn: # III. 第三部分

source: ### Pre-requisites: ### - Complete [Getting Started](../GettingStarted.md) task.
zh_cn: ## 准备工作（TFS/VSTS） - 完成练习： [Getting Started](../GettingStarted.md) .

source: ### Tasks Overview: ###
zh_cn: ## 练习任务概述:

source: **1.** Clone the repository to a local directory.
zh_cn: ## 1. 克隆仓库代码到本地目录.

source: **1.** Go to your **account’s homepage**:
zh_cn: ## 1. 打开 **我的帐户** 页面:

source: **10.** On the **PowerShell Script** task, click on the blue **rename** pencil icon and change the name of the step to **dotnet restore, build, test and publish** and click **OK**
zh_cn: ## 10. 在 **PowerShell Script** 任务中, 点击蓝色的 **rename** 铅笔 图标,更改名称为 **dotnet restore, build, test and publish** ，然后点击 **OK**

source: **11.** Configure the Task: - Select **File Path** for the **Type** property - Enter **"build.ps1"** for the **Script filename** property - Set **$(BuildConfiguration) $(System.DefaultWorkingDirectory) $(build.stagingDirectory)** for the **Arguments** property.
zh_cn: ## 11. 配置上面添加的任务: - 为属性 **Type** 的值选择 **File Path** - 为属性 **Script filename** 设置值为 **"build.ps1"** - 为属性 **Arguments** 设置值为 **$(BuildConfiguration) $(System.DefaultWorkingDirectory) $(build.stagingDirectory)** .

source: **12.** On the **Publish Test Results** task make the following changes: - Change the **Test Result Format** to **VSTest**.
zh_cn: ## 12. 在 **Publish Test Results** 任务中确保遵循以下修改: - 修改 **Test Result Format** 为 **VSTest**.

source: **13.** On the **Copy Publish Artifact** task, change the **Copy Root** property to **$(build.stagingDirectory)**, The **Contents** property to **\*\*\\\*.zip**, The **Artifact Name** property to **drop** and the **Artifact Type** to **Server**.
zh_cn: ## 13. 在 **Copy Publish Artifact** 任务中, 修改属性 **Copy Root** 为 **$(build.stagingDirectory)**, 修改 **Contents** 为 **\*\*\\\*.zip**, 修改 **Artifact Name** 为 **drop** ，设置 **Artifact Type** 为 **Server**.

source: **14** Select the **Variables** page and a new variable that will be used by the build.ps1 PowerShell script; **BuildConfiguration** with a value of **release**.
zh_cn: ## 14** 在 **Variables** 页面，这些变量被用于build.ps1 PowerShell 脚本中; 添加新变量 **BuildConfiguration** ，值为 **release**.

source: **15.** Click on the **Triggers** tab and verify that the **Continuous integration (CI)** option is selected to build the solution every time a change is checked in.
zh_cn: ## 15. 点击 **Triggers** tab页面，确保 **Continuous integration (CI)** 被选中 .

source: **16.** Click **Save** and give the build definition a name.
zh_cn: ## 16.** 点击 **Save**，并为生成定义设置一个名称.

source: **2.** Click **Browse** and then select your team project and click **Navigate**.
zh_cn: ## 2.** 点击 **浏览** ,选择团队项目，点击 **导航**.

source: **2.** Remove the link to GitHub.
zh_cn: ## 2. 移除对 GitHub 的链接.

source: **3.** Find the URL to access the VSTS Git repo
zh_cn: ## 3. 找到TFS/VSTS Git 仓库的访问URL

source: **3.** Once on the project’s home page, click on the **Build** hub at the top of the page, then on **All Definitions**, and then on **New Definition**.
zh_cn: ## 3. 进入主页面后, 点击页面顶部的 **生成** , 然后进入 **所有定义**, 最后点击 **添加生成定义**.

source: **4.** Add the link to VSTS and push your local Git repo
zh_cn: ## 4. 推送本地仓库到TFS/VSTS，并建立链接r

source: **4.** Select the **Empty** build definition, and then click **Next**.
zh_cn: ## 4. 选择 **空定义** 创建生成定义，然后点击 **下一步**.

source: **5.** After clicking the **Next** button: - Select **HOL Team Project**; - Select **HOL** Repository; - Select **Master** as the default branch; - Check **Continuous Integration**; - Change the **Default Agent Queue** to **Hosted VS2017**; - Click **Create**.
zh_cn: ## 5. 然后点击 **下一步** : - 选择 **HOL Team Project**; - 选择 **HOL** Repository; - 选择 **Master** 做为默认分支; - 选择 **Continuous Integration**; - 把 **Default Agent Queue** 改为 **Hosted VS2017**; - 点击 **Create**.

source: **6.** After clicking the **Create** button, On the **Build** tab click the **Add build step** in the Build pane.
zh_cn: ## 6. 点击 **Create** 按扭, 在 **Build** tab 页， **Add build step** 会出现在页面中.

source: **7.** In the **Add tasks** dialog, select the **Utility** page and then add a **PowerShell** task.
zh_cn: ## 7. 在 **Add tasks** 对话框中, 选择 **Utility** 页面，添加一个 **PowerShell** 任务.

source: **8.** Still in the **Add tasks** dialog, select the **Test** page and add a **Publish Test Results**.
zh_cn: ## 8. 还在 **Add tasks** 对话框中,选择 **Test** 页面，添加一个 **Publish Test Results** 任务.

source: **9.** Select the **Utility** page again and add a **Copy and Publish Artifacts** task and then click on **Close**.
zh_cn: ## 9. 选择 **Utility** 页面，添加一个**Copy and Publish Artifacts** 任务，最后点击 **Close** 关闭对话框.

source: - An active Visual Studio Team Services account.
zh_cn: - 一个可用的 TFS(VSTS) 帐号.

source: - Click on Advanced and change the **Working Folder** to **$(System.DefaultWorkingDirectory)**
zh_cn: - 点击高级，设置属性 **Working Folder** 值为 **$(System.DefaultWorkingDirectory)**

source: - On **Search folder** enter the value **$(System.DefaultWorkingDirectory)**
zh_cn: - 修改 **Search folder** 为 **$(System.DefaultWorkingDirectory)**

source: - On the **Test Results File** to **\*\*/testresults.xml**.
zh_cn: - 修改 **Test Results File** 为 **\*\*/testresults.xml**.

source: > **Note:** The build.ps1 script contains commands using the **dotnet.exe** executable used by .Net Core.
zh_cn: **Note:** PS脚本**build.ps1** 使用 .Net Core 的 **dotnet.exe** 执行命令.

source: > **Note:** To enable Continuous integration in your project, check the **Continuous integration (CI)** checkbox.
zh_cn: **Note:** 为使持续集成生效，确保勾选 **Continuous integration (CI)** 一项.

source: > **Note:** We may have multiple repositories and branches, so we need to select the correct Repo and Branch before we can select which Solution to build.
zh_cn: **Note:** 我们通常会有多个仓库，每个仓库的代码都会有多个分支,因此在我们选择构建方案时，需要选择正确的仓库和分支.

source: > **Talking Point:** For this lab we are using the VSTS Git project.
zh_cn: > **注意:** 这次练习我们采用Git的方式来管理源码.

source: > Note: VSTS does support GitHub source code integration for use with VSTS builds, but is outside of the scope of this HOL
zh_cn: Note: 题外话：TFS/VSTS 目前还不支持通过 VS IDE来创建构建，一般我们通过TFS/VSTS Web门户来实现

source: >**Note:** As you can see, you can now do Universal Windows Apps & Xamarin Android/IOS Builds as well as Xcode builds.
zh_cn: **Note:** 如你所见, 你可以定义UWA通用应用、 Xamarin Android/IOS应用的构建，甚至是Xcode 的构建.

source: A continuous integration build will give us the ability check whether the code we checked in can compile and will successfully pass any automated tests that we have created against it.
zh_cn: 定义好的生成定义，使我们可以知道迁入的代码是否编异成功、是否通过自动化测试.

source: Additionally, at the bottom of the web page, you will see the two commands that we will use to push the existing code to VSTS.
zh_cn: 另外, 在页面的底部, 你可以看到有两个命令，通过这些命令我们可以把刚才克隆的代码推送到TFS/VSTS.

source: After a few seconds of downloading, all of the code should now be on your local machine.
zh_cn: 过几分钟，代码应该会被下载到你本地电脑

source: Also make sure the filter includes the appropriate branch (in this case **master** and **Batch Changes** checkbox is unchecked
zh_cn: 同样确保 **master** 和 **Batch Changes** 未被选中

source: Alternatively, you can use a web browser to browse to your account, click into your project, and click the Code tab to get to your default Git repository:
zh_cn: 当然, 你也可以通过浏览器打开你的帐号，进入你的项目，然后在点击 代码 标签页 来获取默认的Git仓库地址:

source: Clone the repository with the following command.
zh_cn: 使用上面的命令克隆仓库.

source: Create Continuous Integration Build
zh_cn: 创建构建

source: Create Continuous Integration Build:** In this step, you will create a build definition that will be triggered every time a commit is pushed to your repository in Visual Studio Team Services.
zh_cn: 创建持续集成构建:** 在这个步骤, 你将定义一个生成，这个生成会在代码每次提交到TFS(VSTS)之后触发.

source: Create a parent **Working Directory** on your local file system.
zh_cn: 在你的本地系统磁盘中创建一个父目录：**Working Directory**.

source: Feel free to use whatever directory name you like, or leave it blank to use the default directory name:
zh_cn: 当然你也可以克隆到任意目录中，也可以留空，克隆到根目录:

source: First, we need to find the URL to empty Git repository in VSTS.
zh_cn: 首先，我们需要找到这个URL来清空我们的TFS/VSTS Git 仓库

source: For instance, on a Windows OS you can create the following directory:
zh_cn: 比如，在Windows系统中你可以创建这样一个目录:

source: HOL - Parts Unlimited WebSite Continuous Integration with Visual Studio Team Services ==================================================================================== In this lab we have an application called PartsUnlimited.
zh_cn: # 动手实验 - 通过使用TFS(VSTS) ，为 Parts Unlimited WebSite 项目 添加持续集成 在这次实验中，我们采用的项目叫作：PartsUnlimited.

source: If you haven't already, create a new team project in your Visual Studio Team Services account that uses Git for source control.
zh_cn: 如果你还没有这份代码，首先要在TFS(VSTS)中创建一个团队项目I，并且源码管理选择Git.

source: If you remember your account name, and the Team Project name you created, the URL to the default Git repo is easily assembled:
zh_cn: 如果你记得自己的帐号, 并且团队项目已创建，这个默认的Git地址很容易得出:

source: Import Source Code into your VSTS Account:** In this step, you will connect your own Visual Studio Team Services account, download the PartsUnlimited source code, and then push it to your own Visual Studio Team Services account.
zh_cn: 用你的TFS(VSTS)帐号导入源码:** 在这个步骤,你将使用自己的帐号连接到TFS(VSTS)， 下载项目 PartsUnlimited 的郑代码，通过练习后，可以推送代码到你TFS(VSTS)代码仓库.

source: In a Windows OS (and assuming you used HOL as the directory name), you can use this command:
zh_cn: 在Windows系统中 (并且确保你使用的是目录名为HOL), 你可以使用下面的命令:

source: In the example below, the clone will be copied into a directory named HOL.
zh_cn: 在下面的示例中, 此次克隆的仓库代码会得到到 HOL目录中.

source: In the local directory from Step 1, use the following command to add VSTS as the Git remote named _origin_.
zh_cn: 进入步骤1创建的本地目录, 使用下面的命令，在远程仓库创建立名为 _origin_的链接.

source: Move into the directory that was just created.
zh_cn: 进入刚刚创建的目录.

source: NOte: the screenshots are out of date and need to be udpated.
zh_cn: NOTE: 上面的帮助文档里面的图片可能已经过期，需要更新，但不影响阅读.

source: Open a command line (one that supports Git) and change to the directory you created above.
zh_cn: 打开Git命令行，并且更改目录为上面创建的.

source: Since we won't be using it any longer, we can delete the reference.
zh_cn: 我们不在使用Github来提交我们的代码，因此我们可以删除这个引用

source: Test the CI Trigger in Visual Studio Team Services
zh_cn: 测试CI 在TFS/VSTS中 被触发

source: Test the CI Trigger in Visual Studio Team Services:** In this step, test the Continuous Integration build (CI) build we created by changing code in the Parts Unlimited project with Visual Studio Team Services.
zh_cn: 验证CI 的触发:** 在这个步骤, 我们通过修改 Parts Unlimited 项目的代码，并提交到TFS(VSTS)以触发我们定义好的构建.

source: The Git repo you just downloaded currently has a remote called _origin_ that points to the GitHub repo.
zh_cn: 刚刚下载的 Git仓库 会通过一个叫 _orgin_ 的配置项指向Github仓库.

source: The build script does the following: restore, build, test, publish, and produce an MSDeploy zip package.
zh_cn: 这些生成脚本执行: restore, build, test, publish, 等动作， 并生成一个 MSDeploy 格式的 zip包.

source: The next couple of steps will allow you to add the PartUnlimited source to the Git master repository.
zh_cn: 在接下来的一系列步骤中，我们使用添加PartUnlimited 源码到Git主仓库.

source: There are two approaches to doing this: a) Use the Git command line, or b) Use Visual Studio.
zh_cn: 有两种方式来完成: a) 使用Git 命令行工具, b) 或者使用宇届第一强IDE： Visual Studio 2017.

source: This means that whenever code is committed and pushed to the master branch, we want to ensure that it integrates into our code correctly to get fast feedback.
zh_cn: 也就是说，在我们的代码提交和推送给主分支后，我想确保代码被正确集成，并可以快速获得反馈.

source: To delete the GitHub remote, use:
zh_cn: 要移除这个引用，我们可以使用以下命令：

source: To do so, we are going to be setting up a Continuous Integration build (CI) that will allow us to compile and run unit tests on our code every time a commit is pushed to Visual Studio Team Services.
zh_cn: 为此, 我们需要配置 我们的构建来完成持续集成 (CI)，使我们的代码一旦提交到TFS(VSTS)，可以自动触发编异、单元测试等动作作.

source: We want to push the application code to your Visual Studio Team Services account in order to use VSTS Build.
zh_cn: 为了能够使用TFS(VSTS)的持续集成功能，我们先要把代码导入到自己的代码仓库中.

source: We want to set up Visual Studio Team Services to be able continuously integrate code into the master branch of code.
zh_cn: 我们通过配置TFS(VSTS) ，可以为主分支代码增加 持续集成 的能力.

source: You can either type the URL you found in Step 3, or simply copy the first command from the VSTS web page.
zh_cn: 你也可以输入步骤3里面的URL地址, 或者从TFS/VSTS Web页面获取这个URL地址.

source: You can paste in the URL if you copied it in Step 1.
zh_cn: 你可以把步骤 1 复制的URL 粘贴过来.

source: You can select which branch you wish to monitor, as well.
zh_cn: 当然你也可以根据项目的需要选择特定的分支代码进行持续集成.

source: [Sign up for Visual Studio Team Services](https://www.visualstudio.com/en-us/docs/setup-admin/team-services/sign-up-for-visual-studio-team-services)
zh_cn: - 可参考的文档： [如何 注册和设置 TFS](#) [如何 注册和设置 Visual Studio Team Services](https://www.visualstudio.com/en-us/docs/setup-admin/team-services/sign-up-for-visual-studio-team-services)

source: git remote add origin https://<account>.visualstudio.com\<project>\_git\<project> Now you can push the code, including history, to VSTS:
zh_cn: git remote add origin https://<account>.visualstudio.com\<project>\_git\<project> 现在你可以推送代码了到TFS/VSTS，包括提交的历史记录:
